Revit 2024 API
DWFImportOptions.SetSheetViews Method
 Set sheet views where DWF markups are imported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetSheetViews(
	IList<ElementId> sheetViews
)
Visual Basic
Public Sub SetSheetViews ( _
	sheetViews As IList(Of ElementId) _
)
Visual C++
public:
void SetSheetViews(
	IList<ElementId^>^ sheetViews
)
Parameters
sheetViews
Type: System.Collections.Generic.IList<ElementId>
 An array of imported sheet views.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DWFImportOptions Class
Autodesk.Revit.DB Namespace